<?php

namespace App\Helpers;

class CompanyNameTransformer
{
    public static function transform($fullName)
    {
        $patterns = [
            'ТОВАРИЩЕСТВО С ОГРАНИЧЕННОЙ ОТВЕТСТВЕННОСТЬЮ' => 'ТОО',
            'РЕСПУБЛИКАНСКОЕ ГОСУДАРСТВЕННОЕ УЧРЕЖДЕНИЕ' => 'РГУ',
            'КОММУНАЛЬНОЕ ГОСУДАРСТВЕННОЕ УЧРЕЖДЕНИЕ' => 'КГУ',
            'КОММУНАЛЬНОЕ ГОСУДАРСТВЕННОЕ КАЗЕННОЕ ПРЕДПРИЯТИЕ' => 'КГКП',
            'ОБЩЕСТВЕННОЕ ОБЪЕДИНЕНИЕ' => 'ОО',
            'ГОСУДАРСТВЕННОЕ УЧРЕЖДЕНИЕ' => 'ГУ',
            'ЧАСТНЫЙ БЛАГОТВОРИТЕЛЬНЫЙ ФОНД' => 'ЧБФ',
            'ГОСУДАРСТВЕННОЕ КОММУНАЛЬНОЕ КАЗЕННОЕ ПРЕДПРИЯТИЕ' => 'ГККП',
            'ГОСУДАРСТВЕННОЕ КОММУНАЛЬНОЕ ПРЕДПРИЯТИЕ' => 'ГКП',
            'ОБЩЕСТВЕННЫЙ ФОНД' => 'ОФ',
            'ПРОИЗВОДСТВЕННЫЙ КООПЕРАТИВ' => 'ПК',
            'ОБЪЕДИНЕНИЕ ИНДИВИДУАЛЬНЫХ ПРЕДПРИНИМАТЕЛЕЙ' => 'ОИП',
            'ОБЪЕДИНЕНИЕ ЮРИДИЧЕСКИХ ЛИЦ И ИНДИВИДУАЛЬНЫХ ПРЕДПРИНИМАТЕЛЕЙ' => 'ЮЛиИП',
            'ОБЪЕДИНЕНИЕ ИНДИВИДУАЛЬНЫХ ПРЕДПРИНИМАТЕЛЕЙ, КРЕСТЬЯНСКИХ ХОЗЯЙСТВ И ЮРИДИЧЕСКИХ ЛИЦ' => 'ОИП, ХЛиЮЛ',
            'ФИЛИАЛ ОБЪЕДИНЕНИЯ' => 'ФО',
            'ОБЪЕДИНЕНИЕ ИНДИВИДУАЛЬНЫХ ПРЕДПРИНИМАТЕЛЕЙ И ЮРИДИЧЕСКИХ ЛИЦ' => 'ОИПиЮЛ',
            'РЕГИОНАЛЬНЫЙ ФИЛИАЛ ПО ГОРОДУ ЖЕЗКАЗГАН' => 'РФ по г. Жезказган',
            'АКЦИОНЕРНОЕ ОБЩЕСТВО' => 'АО',
            'Индивидуальный предприниматель' => 'ИП',
            'ТОВАРИЩЕСТВО С ОГРАНИЧЕННОЙ ОТВЕТСТВЕННОСТЬЮ ПЛЕМЕННОЕ ХОЗЯЙСТВО' => 'ТОО ПЛЕМЕННОЕ ХОЗЯЙСТВО',
            'КООПЕРАТИВ СОБСТВЕННИКОВ КВАРТИР' => 'КСК',
            'ЧАСТНЫЙ ФОНД' => 'ЧФ'
            
        ];

        foreach ($patterns as $pattern => $replacement) {
            $patternFormatted = '/'.preg_quote($pattern, '/').'\s+"/';
            if (preg_match($patternFormatted, $fullName)) {
                $fullName = preg_replace($patternFormatted, $replacement.' "', $fullName);
                break; // Прерываем цикл после первой успешной замены
            }
        }

        return $fullName;
    }
}
